# -*- coding: utf-8 -*-
# @Time    : 2020/1/2 23:07
# @Author  : wanghc
# @File    : 1.常量变量.py
# @Software: PyCharm


# 常量： 一旦赋值，就不能改变他的值。  即 不能对他重新赋值
# 变量： 一个名字，在赋值符号左边，这个名字可以指代赋值符号右边的内容
# 字面常量： 一个单独出现的量，未赋值给任何的常量或者变量

# python一切皆对象，赋值即定义    （好难理解）

# 一切皆对象： 哪怕是个字符串，也是个对象

# 赋值即定义： python一旦用等号给某一个变量赋值了，那么就对这个变量名进行了定义。
# 一旦对该变量进行值的更新，不是说将变量的值修改了，而是重新定义了一个新的变量。

i = 3

print(type(i),'  ',id(i))  # id表示 i 这个变量此时在内存中的结果

i = 'a'

print(type(i),'  ',id(i)) # 重新赋值后，Id发生变化

# a 字面常量，没有值，python解释器会抛出 not defined 的错误

# python没有常量，也没有字面常量，只有变量


