# -*- coding: utf-8 -*-
# @Time    : 2020/3/12 20:57
# @Author  : wanghc
# @File    : 6.成员运算符.py
# @Software: PyCharm


'''
用集合，很多地方会用到成员包含计算 in , not in

用成员运算符判断一个元素是否在容器中
集合、list、tuple、str、int都是
'''

print(3 in [1,3,4]) # True
print(5 in [1,3,4]) # False
print('www' in 'www问问') #True

# 成员运算符返回布尔值，所以经常用在if判断语句中

'''
为什么到集合这里讲成员运算符？
因为集合的成员运算和其他线性结构的时间复杂度不同
进行一个效率计算，%%timeit 这是ipython提供的一个magic
'''
lst = list(range(10000))
s = set(range(10000))


'''
1、做成员计算时，列表的效率和列表的规模有关，规模越大，速度越慢
这也是 列表是线性相关的原因，他的数据结构是线性存储的

2、做成员计算时，集合的效率和集合的规模无关。

集合的效率:O(1)
列表的效率:O(n)

可能的话，做成员运算的时候，把列表、元组转换成集合做。
'''

