# -*- coding: utf-8 -*-
# @Time    : 2020/12/28 14:16
# @Author  : wanghc
# @File    : 1.杨辉三角.py
# @Software: PyCharm


'''
杨辉三角形，又称帕斯卡三角形、贾宪三角形、海亚姆三角形、巴斯卡三角形，是二项式系数的一种写法，形似三角形，
在中国首现于南宋杨辉的《详解九章算法》得名，书中杨辉说明是引自贾宪的《释锁算书》，故又名贾宪三角形。前 9.测试 行写出来如下：
　　　　　　　　１               lst[0][0] = 1
　　　　　　　１　１             lst[1][0] = 1    lst[1][-1] = 1
　　　　　　１　２　１           lst[2][0] = 1  lst[2][1] = lst[1][0] + lst[1][-1]    lst[2][-1] = 1
　　　　　１　３　３　１         lst[3][0] = 1  lst[3][1] = lst[2][0] + lst[2][1]   lst[3][2] = lst[2][1] + lst[2][2]   lst[3][-1] = 1
　　　　１　４　６　４　１
　　　１　５　10　10　５　１
　　１　６　15　20　15　６　１
　１　７　21　35　35　21　７　１
１　８　28　56　70　56　28　８　１

规律：
第n行，有n:n+1个元素
第一个和最后一个元素都是1
'''

# 求杨辉三角第n行第k列的值。

n = 5
k = 4

# 用这个lst保存杨辉三角
lst = []
for i in range(n + 1):
    # 第一个总是1
    row = [1]

    lst.append(row)

    # 第1行就是一个元素，就是1
    if i == 0:
        continue

    for j in range(1, i):
        row.append(lst[i - 1][j - 1] + lst[i - 1][j])
    row.append(1)

print(lst[3][1])
