# -*- coding: utf-8 -*-

"""
@author: wanghc
@software: PyCharm
@file: 3.参数默认值.py
@time: 2020/12/28 22:28
"""

# 3.参数默认值
'''
参数可以有默认值，当一个参数有默认值时，调用时如果不传递此参数，会使用默认值

限制：带默认值的参数必须在不带默认值的参数之后。不然解释器不知道要把值传递给第一个还是第二个
'''


def moren(x, y='默认值'):
    return x + y


# 参数默认值的应用
def connect(host='127.0.0.1', port='3306', user='root', password='', db='test'):
    pass


'''
这是一个创建数据库连接的函数，需要传入ip地址，端口号，用户名密码，数据库名。每次创建连接需要传入这么多参数想想就麻烦，
换成默认参数就很简单。
默认参数的意义在于：定义了一些平时经常用的参数，上面的例子，调用的时候只需要传入部分修改的参数即可。
比如：
connect('192.168.10.20',db='aaa')
'''
