# -*- coding: utf-8 -*-

"""
@author: wanghc
@software: PyCharm
@file: 1.位置参数解构.py
@time: 2020/12/28 22:40
"""

def add(x, y):
    ret = x + y
    print('{} + {} = {}'.format(x, y, ret))
    return ret

'''
假设现在有这么一个累加器，我们调用它时会考虑使用位置参数还是关键字参数，还是混合使用
'''

add(1, y=2)
add(x=1, y=2)

'''
那么当在实际场景中，比如现在通过客户端发来一个接口请求，参数是 [1,2]
这时候想把列表里的内容传到add函数该怎么操作？
'''
t = [1, 2]
add(t[0], t[1])

# 上述方式不太优雅，我们可以这样
add(*t)
'''
传入一个元组，并且在元组前面加上一个星号，这样就可以把一个可迭代对象解构成位置参数了。

注意不要和可变参数混淆
参数解构发生在调用函数的时候，而可变参数发生在函数定义的时候
'''

