# -*- coding: utf-8 -*-
# @Time    : 2020/3/5 21:56
# @Author  : wanghc
# @File    : 5.python中的_.py
# @Software: PyCharm

'''
python中，_代表的意思就是如果这个变量对于我来说没有什么意义，可以用下划线的方式去承接它。
因为在一个文件里，可能会有多处命名无用变量的时候，如果一些无用变量非常大，占用的内存就很大了，
为了减少无用变量的产出，优化性能表现，可以使用下划线。
'''

lst = list(range(10))

head,*_,last = lst

print(_)

'''
明确：单个下划线也是python的合法标识符，但是如果不是要丢弃一个变量，通常不要用单个下划线表示一个有意义的变量。

拓展：有一个语言库叫gettext，用来翻译文字。一般使用gettext的时候，会把它重命名为_,因为有太多地方用到它，下划线方便些。
'''

lst2 = [1,(2,3),5]
'''用下划线把没必要的变量承接住，这样就不用额外的变量开销了。'''
_,v,*_ = lst2
print(v) # (2, 3)
_,val = v
print(val) # 3
# 所以结构支持多层次

_,(*_,v2),*_ = lst2
print(v2) # 3


# 字符串中的partition方法，返回一个三元组
# 第二个值是符号，没必要为他申请一个新的变量，可以用下划线做
key,_,value = 'env = prod'.partition('=')